## Plan Result (sbox_landing - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 295 to add, 5 to change, 7 to destroy.</code></pre>

* Create
  * azurerm_container_group.runner[&#34;01dlrm-ingestionengine&#34;]
  * azurerm_role_assignment.roles[&#34;01-ingest01-logic-sbox-Group-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)&#34;]
  * azurerm_role_assignment.roles[&#34;01-ingest01-logic-sbox-Group-Storage-Blob-Data-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)&#34;]
  * azurerm_role_assignment.roles[&#34;01-ingest01-logic-sbox-User-Owner-dominic.leary@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;01-ingest01-logic-sbox-User-Owner-prasanna.krishnan@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;01-ingest01-logic-sbox-User-Owner-qiang.zhou@hmcts.net&#34;]
  * azurerm_role_assignment.roles[&#34;01-ingest01-logic-sbox-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net&#34;]
  * azurerm_role_assignment.roles[&#34;01-ingest01-main-sbox-Group-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)&#34;]
  * azurerm_role_assignment.roles[&#34;01-ingest01-main-sbox-Group-Storage-Blob-Data-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)&#34;]
  * azurerm_role_assignment.roles[&#34;01-ingest01-main-sbox-User-Owner-dominic.leary@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;01-ingest01-main-sbox-User-Owner-prasanna.krishnan@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;01-ingest01-main-sbox-User-Owner-qiang.zhou@hmcts.net&#34;]
  * azurerm_role_assignment.roles[&#34;01-ingest01-main-sbox-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net&#34;]
  * azurerm_role_assignment.roles[&#34;01-ingest01-network-sbox-Group-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)&#34;]
  * azurerm_role_assignment.roles[&#34;01-ingest01-network-sbox-Group-Storage-Blob-Data-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)&#34;]
  * azurerm_role_assignment.roles[&#34;01-ingest01-network-sbox-User-Owner-dominic.leary@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;01-ingest01-network-sbox-User-Owner-prasanna.krishnan@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;01-ingest01-network-sbox-User-Owner-qiang.zhou@hmcts.net&#34;]
  * azurerm_role_assignment.roles[&#34;01-ingest01-network-sbox-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;curated&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_data_factory_integration_runtime_self_hosted.this
  * module.data_landing_zone[&#34;01&#34;].azurerm_eventhub_namespace.this
  * module.data_landing_zone[&#34;01&#34;].azurerm_key_vault_access_policy.logging_vault_reders[&#34;145da22b-a3cb-4ba8-b735-22c94b5eea6c&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_key_vault_access_policy.metadata_vault_reders[&#34;145da22b-a3cb-4ba8-b735-22c94b5eea6c-meta001&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_key_vault_access_policy.metadata_vault_reders[&#34;145da22b-a3cb-4ba8-b735-22c94b5eea6c-meta002&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_key_vault_secret.legacy_database_password[&#34;legacy-sql&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_key_vault_secret.legacy_database_username[&#34;legacy-sql&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_key_vault_secret.log_analytics_workspace_id
  * module.data_landing_zone[&#34;01&#34;].azurerm_key_vault_secret.log_analytics_workspace_secret
  * module.data_landing_zone[&#34;01&#34;].azurerm_key_vault_secret.mssql_password
  * module.data_landing_zone[&#34;01&#34;].azurerm_key_vault_secret.mssql_username
  * module.data_landing_zone[&#34;01&#34;].azurerm_key_vault_secret.mysql_connection_string
  * module.data_landing_zone[&#34;01&#34;].azurerm_key_vault_secret.mysql_password
  * module.data_landing_zone[&#34;01&#34;].azurerm_key_vault_secret.mysql_username
  * module.data_landing_zone[&#34;01&#34;].azurerm_key_vault_secret.synapse_sql_password
  * module.data_landing_zone[&#34;01&#34;].azurerm_key_vault_secret.synapse_sql_username
  * module.data_landing_zone[&#34;01&#34;].azurerm_log_analytics_workspace.this
  * module.data_landing_zone[&#34;01&#34;].azurerm_monitor_diagnostic_setting.runtimes_datafactory
  * module.data_landing_zone[&#34;01&#34;].azurerm_monitor_diagnostic_setting.shared_integration_datafactory
  * module.data_landing_zone[&#34;01&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.adf.azure.com&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.blob.core.windows.net&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.database.windows.net&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.datafactory.azure.net&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.dev.azuresynapse.net&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.dfs.core.windows.net&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.mysql.database.azure.com&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.servicebus.windows.net&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.sql.azuresynapse.net&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.vaultcore.azure.net&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_public_ip.legacy_pip[&#34;legacy-sql&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_resource_group.this[&#34;logic&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_resource_group.this[&#34;main&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_resource_group.this[&#34;network&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_role_assignment.datafactory_databricks
  * module.data_landing_zone[&#34;01&#34;].azurerm_role_assignment.runtimes_datafactory_storage[&#34;curated&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_role_assignment.runtimes_datafactory_storage[&#34;external&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_role_assignment.runtimes_datafactory_storage[&#34;landing&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_role_assignment.runtimes_datafactory_storage[&#34;raw&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_role_assignment.runtimes_datafactory_storage[&#34;workspace&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_role_assignment.shared_integration_datafactory_storage[&#34;curated&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_role_assignment.shared_integration_datafactory_storage[&#34;external&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_role_assignment.shared_integration_datafactory_storage[&#34;landing&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_role_assignment.shared_integration_datafactory_storage[&#34;raw&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_role_assignment.shared_integration_datafactory_storage[&#34;workspace&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;curated&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;external&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;landing&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;raw&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;workspace&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_storage_management_policy.this[&#34;curated&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_storage_management_policy.this[&#34;external&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_storage_management_policy.this[&#34;landing&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_storage_management_policy.this[&#34;raw&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_storage_management_policy.this[&#34;workspace&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_synapse_workspace.this
  * module.data_landing_zone[&#34;01&#34;].azurerm_synapse_workspace_aad_admin.aad
  * module.data_landing_zone[&#34;01&#34;].random_password.legacy_database_password[&#34;legacy-sql&#34;]
  * module.data_landing_zone[&#34;01&#34;].random_password.synapse_sql_password
  * module.data_landing_zone[&#34;01&#34;].random_string.legacy_database_username[&#34;legacy-sql&#34;]
  * module.logic[&#34;01&#34;].azurerm_logic_app_standard.this
  * module.logic[&#34;01&#34;].azurerm_private_endpoint.this
  * module.logic[&#34;01&#34;].azurerm_resource_group_template_deployment.sqlConn
  * module.logic[&#34;01&#34;].azurerm_role_assignment.storage
  * module.logic[&#34;01&#34;].azurerm_service_plan.this
  * module.logic[&#34;01&#34;].azurerm_storage_account.this
  * module.logic[&#34;01&#34;].azurerm_storage_account_network_rules.this
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;01&#34;].module.legacy_database[&#34;legacy-sql&#34;].azurerm_network_interface.vm_nic
  * module.data_landing_zone[&#34;01&#34;].module.legacy_database[&#34;legacy-sql&#34;].azurerm_windows_virtual_machine.winvm[0]
  * module.data_landing_zone[&#34;01&#34;].module.logging_vault.azurerm_key_vault.kv
  * module.data_landing_zone[&#34;01&#34;].module.logging_vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.data_landing_zone[&#34;01&#34;].module.logging_vault.azurerm_key_vault_access_policy.developer[0]
  * module.data_landing_zone[&#34;01&#34;].module.logging_vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone[&#34;01&#34;].module.logging_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone[&#34;01&#34;].module.logging_vault_pe.azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;MetadataControl&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.metadata_mssql.azurerm_mssql_server.this
  * module.data_landing_zone[&#34;01&#34;].module.metadata_mssql.azurerm_private_endpoint.metadata_mssql_pe[0]
  * module.data_landing_zone[&#34;01&#34;].module.metadata_mssql.random_password.mssql_password[0]
  * module.data_landing_zone[&#34;01&#34;].module.metadata_mysql.azurerm_mysql_flexible_database.this[&#34;ingest01-HiveMetastoreDb-sbox&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.metadata_mysql.azurerm_mysql_flexible_server.this
  * module.data_landing_zone[&#34;01&#34;].module.metadata_mysql.random_password.mysql_password[0]
  * module.data_landing_zone[&#34;01&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault.kv
  * module.data_landing_zone[&#34;01&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault_access_policy.creator_access_policy
  * module.data_landing_zone[&#34;01&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault_access_policy.developer[0]
  * module.data_landing_zone[&#34;01&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone[&#34;01&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone[&#34;01&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault.kv
  * module.data_landing_zone[&#34;01&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.creator_access_policy
  * module.data_landing_zone[&#34;01&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.developer[0]
  * module.data_landing_zone[&#34;01&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone[&#34;01&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone[&#34;01&#34;].module.metadata_vault_pe[&#34;meta001&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.metadata_vault_pe[&#34;meta002&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_network_security_group.this[&#34;nsg&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_network_security_rule.deny_inbound[&#34;nsg&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Allow-F5-VPN-Inbound&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Allow-MoJ-RDP-Inbound&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Allow_SDS_PTL_ADO_Agents&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-eventhub&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-sql&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-storage&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-webapp&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-worker-inbound&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-worker-outbound&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_route.this[&#34;rt-rfc_1918_class_a&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_route.this[&#34;rt-rfc_1918_class_b&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_route.this[&#34;rt-rfc_1918_class_c&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_route_table.this[&#34;rt&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-private&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-product-private&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-product-public&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-public&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-integration-001&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-integration-002&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-product-001&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-product-002&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet.this[&#34;vnet-gh-runners&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet.this[&#34;vnet-services&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet.this[&#34;vnet-services-mysql&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-bricks-private&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-bricks-product-private&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-bricks-product-public&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-bricks-public&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-integration-001&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-integration-002&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-product-001&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-product-002&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-gh-runners&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-services&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-services-mysql&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-bricks-private&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-bricks-product-private&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-bricks-product-public&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-bricks-public&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-integration-001&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-integration-002&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-product-001&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-product-002&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-gh-runners&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-services&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-services-mysql&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_virtual_network.this[&#34;vnet&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.azurerm_data_factory.this
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.azurerm_data_factory_integration_runtime_azure.this
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest01landingsbox&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.azurerm_data_factory_linked_service_key_vault.this[&#34;ingest01-meta002-sbox&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-eventhub&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;landing-blob&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;landing-dfs&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;purview&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.azurerm_private_endpoint.this[&#34;dataFactory&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.azurerm_private_endpoint.this[&#34;portal&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.null_resource.dependant_private_endpoint_approvals[&#34;purview-eventhub&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.null_resource.dependant_private_endpoint_approvals[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.null_resource.dependant_private_endpoint_approvals[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;landing-blob&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;landing-dfs&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;purview&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_databricks.azurerm_databricks_workspace.this
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory.this
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_integration_runtime_azure.this
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest01curatedsbox&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest01rawsbox&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_databricks.this[&#34;ingest01-integration-databricks001-sbox&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_sql_database.this[&#34;MetadataControl&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_key_vault.this[&#34;ingest01-meta001-sbox&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_key_vault.this[&#34;ingest01-meta002-sbox&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_sql_server.this[&#34;ingest01-metadata-mssql-sbox&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-eventhub&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;landing-blob&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;landing-dfs&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;mssql&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;purview&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;storage-curated&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;storage-raw&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_private_endpoint.this[&#34;dataFactory&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_private_endpoint.this[&#34;portal&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.null_resource.dependant_private_endpoint_approvals[&#34;purview-eventhub&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.null_resource.dependant_private_endpoint_approvals[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.null_resource.dependant_private_endpoint_approvals[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;landing-blob&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;landing-dfs&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;mssql&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;purview&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;storage-curated&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;storage-raw&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_eventhub_pe.azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.shared_product_databricks.azurerm_databricks_workspace.this
  * module.data_landing_zone[&#34;01&#34;].module.shir001.azurerm_key_vault_secret.shir_password
  * module.data_landing_zone[&#34;01&#34;].module.shir001.azurerm_lb.shir_lb
  * module.data_landing_zone[&#34;01&#34;].module.shir001.azurerm_lb_backend_address_pool.shir
  * module.data_landing_zone[&#34;01&#34;].module.shir001.azurerm_lb_nat_pool.shir
  * module.data_landing_zone[&#34;01&#34;].module.shir001.azurerm_lb_probe.shir
  * module.data_landing_zone[&#34;01&#34;].module.shir001.azurerm_lb_rule.shir
  * module.data_landing_zone[&#34;01&#34;].module.shir001.azurerm_virtual_machine_scale_set_extension.shir_install
  * module.data_landing_zone[&#34;01&#34;].module.shir001.random_password.shir_password
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;curated&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;curated&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;curated&#34;].azurerm_storage_container.container[&#34;di001&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;curated&#34;].azurerm_storage_container.container[&#34;di002&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;curated&#34;].random_string.storage_account_random_string
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;curated&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;curated&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;curated&#34;].time_static.pim_start
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;external&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;external&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;external&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;external&#34;].random_string.storage_account_random_string
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;external&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;external&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;external&#34;].time_static.pim_start
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;landing&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;landing&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;landing&#34;].azurerm_storage_container.container[&#34;landing&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;landing&#34;].random_string.storage_account_random_string
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;landing&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;landing&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;landing&#34;].time_static.pim_start
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;raw&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;raw&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;raw&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;raw&#34;].azurerm_storage_container.container[&#34;di001&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;raw&#34;].azurerm_storage_container.container[&#34;di002&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;raw&#34;].random_string.storage_account_random_string
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;raw&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;raw&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;raw&#34;].time_static.pim_start
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;workspace&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_container.container[&#34;dp001&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_container.container[&#34;dp002&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;workspace&#34;].random_string.storage_account_random_string
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;workspace&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;workspace&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;workspace&#34;].time_static.pim_start
  * module.data_landing_zone[&#34;01&#34;].module.storage_pe[&#34;curated-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.storage_pe[&#34;curated-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.storage_pe[&#34;external-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.storage_pe[&#34;external-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.storage_pe[&#34;landing-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.storage_pe[&#34;landing-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.storage_pe[&#34;raw-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.storage_pe[&#34;raw-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.storage_pe[&#34;workspace-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.storage_pe[&#34;workspace-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.synapse_pe[&#34;dev&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.synapse_pe[&#34;sql&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.synapse_pe[&#34;sqlOnDemand&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.vnet_peer_hub.azurerm_virtual_network_peering.initiator_to_target
  * module.data_landing_zone[&#34;01&#34;].module.vnet_peer_hub.azurerm_virtual_network_peering.target_to_initiator
  * module.logic[&#34;01&#34;].module.application_insights.azurerm_application_insights.this
  * module.logic[&#34;01&#34;].module.application_insights.azurerm_monitor_activity_log_alert.main[0]
  * module.data_landing_zone[&#34;01&#34;].module.legacy_database[&#34;legacy-sql&#34;].module.vm-bootstrap[0].azurerm_monitor_data_collection_rule_association.windows_vm_dcra[0]
  * module.data_landing_zone[&#34;01&#34;].module.legacy_database[&#34;legacy-sql&#34;].module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0]
  * module.data_landing_zone[&#34;01&#34;].module.legacy_database[&#34;legacy-sql&#34;].module.vm-bootstrap[0].azurerm_virtual_machine_extension.endpoint_protection[0]
  * module.data_landing_zone[&#34;01&#34;].module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0]
  * module.data_landing_zone[&#34;01&#34;].module.shir001.module.shir_vmss.random_string.password
* Update
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_server.this
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Allow-MoJ-RDP-Inbound&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-integration-001&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0]
* Delete
  * azurerm_role_assignment.roles[&#34;00-ingest00-logic-sbox-User-Owner-Matt.Lorentzen@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-main-sbox-User-Owner-Matt.Lorentzen@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-network-sbox-User-Owner-Matt.Lorentzen@HMCTS.NET&#34;]
* Replace
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].time_static.pim_expiry




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_container_group.runner["01dlrm-ingestionengine"] will be created
  + resource "azurerm_container_group" "runner" {
      + dns_name_label_reuse_policy = "Unsecure"
      + exposed_port                = (known after apply)
      + fqdn                        = (known after apply)
      + id                          = (known after apply)
      + ip_address                  = (known after apply)
      + ip_address_type             = "Private"
      + location                    = "uksouth"
      + name                        = "ingest01-runner-sbox"
      + network_profile_id          = (known after apply)
      + os_type                     = "Linux"
      + resource_group_name         = "ingest01-main-sbox"
      + restart_policy              = "Always"
      + sku                         = "Standard"
      + subnet_ids                  = (known after apply)
      + tags                        = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }

      + container {
          + commands              = (known after apply)
          + cpu                   = 0.5
          + environment_variables = {
              + "GH_OWNER"           = "hmcts"
              + "GH_REPOSITORY"      = "dlrm-ingestionengine"
              + "GH_TOKEN"           = (sensitive value)
              + "LABELS"             = "sandbox"
              + "RUNNER_NAME_PREFIX" = "landing01-sbox-runner"
            }
          + image                 = "hmctspublic.azurecr.io/github-runner:prod-2f01d4c5-1716373733"
          + memory                = 1.5
          + name                  = "runner"

          + ports {
              + port     = 8080
              + protocol = "TCP"
            }
        }
    }

  # azurerm_role_assignment.roles["00-ingest00-logic-sbox-User-Owner-Matt.Lorentzen@HMCTS.NET"] will be destroyed
  # (because key ["00-ingest00-logic-sbox-User-Owner-Matt.Lorentzen@HMCTS.NET"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logic-sbox/providers/Microsoft.Authorization/roleAssignments/a359a245-418f-4b73-be96-1fe0d0cf10a4" -> null
      - name                                   = "a359a245-418f-4b73-be96-1fe0d0cf10a4" -> null
      - principal_id                           = "ffb2cb96-d318-48c8-bfd4-b7d8c38743d8" -> null
      - principal_type                         = "User" -> null
      - role_definition_id                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> null
      - role_definition_name                   = "Owner" -> null
      - scope                                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logic-sbox" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.roles["00-ingest00-main-sbox-User-Owner-Matt.Lorentzen@HMCTS.NET"] will be destroyed
  # (because key ["00-ingest00-main-sbox-User-Owner-Matt.Lorentzen@HMCTS.NET"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Authorization/roleAssignments/79cc37ee-02af-3c0b-9152-849a62c82e62" -> null
      - name                                   = "79cc37ee-02af-3c0b-9152-849a62c82e62" -> null
      - principal_id                           = "ffb2cb96-d318-48c8-bfd4-b7d8c38743d8" -> null
      - principal_type                         = "User" -> null
      - role_definition_id                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> null
      - role_definition_name                   = "Owner" -> null
      - scope                                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.roles["00-ingest00-network-sbox-User-Owner-Matt.Lorentzen@HMCTS.NET"] will be destroyed
  # (because key ["00-ingest00-network-sbox-User-Owner-Matt.Lorentzen@HMCTS.NET"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Authorization/roleAssignments/a0bf2e48-5c6f-1e66-a114-71e784f86aca" -> null
      - name                                   = "a0bf2e48-5c6f-1e66-a114-71e784f86aca" -> null
      - principal_id                           = "ffb2cb96-d318-48c8-bfd4-b7d8c38743d8" -> null
      - principal_type                         = "User" -> null
      - role_definition_id                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> null
      - role_definition_name                   = "Owner" -> null
      - scope                                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.roles["01-ingest01-logic-sbox-Group-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "145da22b-a3cb-4ba8-b735-22c94b5eea6c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["01-ingest01-logic-sbox-Group-Storage-Blob-Data-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "145da22b-a3cb-4ba8-b735-22c94b5eea6c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["01-ingest01-logic-sbox-User-Owner-dominic.leary@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8c3e64ea-b92f-4e47-b6d9-7abbb1df48e3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["01-ingest01-logic-sbox-User-Owner-prasanna.krishnan@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c064d48d-defc-4a2f-afba-5c8571d44de4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["01-ingest01-logic-sbox-User-Owner-qiang.zhou@hmcts.net"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fb7d9d98-9e59-42cf-a9fd-a32c3990170e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["01-ingest01-logic-sbox-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fb7d9d98-9e59-42cf-a9fd-a32c3990170e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["01-ingest01-main-sbox-Group-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "145da22b-a3cb-4ba8-b735-22c94b5eea6c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["01-ingest01-main-sbox-Group-Storage-Blob-Data-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "145da22b-a3cb-4ba8-b735-22c94b5eea6c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["01-ingest01-main-sbox-User-Owner-dominic.leary@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8c3e64ea-b92f-4e47-b6d9-7abbb1df48e3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["01-ingest01-main-sbox-User-Owner-prasanna.krishnan@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c064d48d-defc-4a2f-afba-5c8571d44de4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["01-ingest01-main-sbox-User-Owner-qiang.zhou@hmcts.net"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fb7d9d98-9e59-42cf-a9fd-a32c3990170e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["01-ingest01-main-sbox-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fb7d9d98-9e59-42cf-a9fd-a32c3990170e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["01-ingest01-network-sbox-Group-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "145da22b-a3cb-4ba8-b735-22c94b5eea6c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["01-ingest01-network-sbox-Group-Storage-Blob-Data-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "145da22b-a3cb-4ba8-b735-22c94b5eea6c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["01-ingest01-network-sbox-User-Owner-dominic.leary@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8c3e64ea-b92f-4e47-b6d9-7abbb1df48e3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["01-ingest01-network-sbox-User-Owner-prasanna.krishnan@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c064d48d-defc-4a2f-afba-5c8571d44de4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["01-ingest01-network-sbox-User-Owner-qiang.zhou@hmcts.net"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fb7d9d98-9e59-42cf-a9fd-a32c3990170e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["01-ingest01-network-sbox-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fb7d9d98-9e59-42cf-a9fd-a32c3990170e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_storage_data_lake_gen2_filesystem.this["curated"] will be created
  + resource "azurerm_storage_data_lake_gen2_filesystem" "this" {
      + default_encryption_scope = (known after apply)
      + group                    = (known after apply)
      + id                       = (known after apply)
      + name                     = "ingest00-curated-sbox"
      + owner                    = (known after apply)
      + storage_account_id       = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/reso

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

        }
    }

  # module.data_landing_zone["01"].module.synapse_pe["sql"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest01-product-synapse001-sql-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest01-main-sbox"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.sql.azuresynapse.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest01-product-synapse001-sbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sql",
            ]
        }
    }

  # module.data_landing_zone["01"].module.synapse_pe["sqlOnDemand"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest01-product-synapse001-sqlOnDemand-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest01-main-sbox"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.sql.azuresynapse.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest01-product-synapse001-sbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sqlOnDemand",
            ]
        }
    }

  # module.data_landing_zone["01"].module.vnet_peer_hub.azurerm_virtual_network_peering.initiator_to_target will be created
  + resource "azurerm_virtual_network_peering" "initiator_to_target" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "ingest01-vnet-sbox-to-hub"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/virtualNetworks/hmcts-hub-sbox-int"
      + resource_group_name                    = "ingest01-network-sbox"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "ingest01-vnet-sbox"
    }

  # module.data_landing_zone["01"].module.vnet_peer_hub.azurerm_virtual_network_peering.target_to_initiator will be created
  + resource "azurerm_virtual_network_peering" "target_to_initiator" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "hub-to-ingest01-vnet-sbox"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest01-vnet-sbox"
      + resource_group_name                    = "hmcts-hub-sbox-int"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "hmcts-hub-sbox-int"
    }

  # module.logic["01"].module.application_insights.azurerm_application_insights.this will be created
  + resource "azurerm_application_insights" "this" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = 50
      + daily_data_cap_notifications_disabled = true
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "data-landing-sbox"
      + resource_group_name                   = "ingest01-logic-sbox"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
      + workspace_id                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-sandbox"
    }

  # module.logic["01"].module.application_insights.azurerm_monitor_activity_log_alert.main[0] will be created
  + resource "azurerm_monitor_activity_log_alert" "main" {
      + description         = "Monitors for application insight reaching it's daily cap."
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "Application Insights daily cap reached - data-landing-sbox"
      + resource_group_name = "ingest01-logic-sbox"
      + scopes              = (known after apply)
      + tags                = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }

      + action {
          + action_group_id    = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actiongroups/sds-alerts-slack-warning-alerts"
          + webhook_properties = {
              + "from"           = "terraform"
              + "slackChannelId" = null
            }
        }

      + criteria {
          + category       = "Administrative"
          + level          = "Warning"
          + operation_name = "Microsoft.Insights/Components/DailyCapReached/Action"
          + resource_id    = (known after apply)

          + resource_health (known after apply)

          + service_health (known after apply)
        }
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine_scale_set" "windows_scale_set" {
        id                                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Compute/virtualMachineScaleSets/ingest00-shir001-vmss-sbox"
        name                                              = "ingest00-shir001-vmss-sbox"
        tags                                              = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (33 unchanged attributes hidden)

      - scale_in {
          - force_deletion_enabled = false -> null
          - rule                   = "Default" -> null
        }

        # (5 unchanged blocks hidden)
    }

  # module.data_landing_zone["01"].module.legacy_database["legacy-sql"].module.vm-bootstrap[0].azurerm_monitor_data_collection_rule_association.windows_vm_dcra[0] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "windows_vm_dcra" {
      + data_collection_rule_id = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.Insights/dataCollectionRules/ama-windows-vm-logs"
      + description             = "Association between a windows VM and the appropriate data collection rule."
      + id                      = (known after apply)
      + name                    = (known after apply)
      + target_resource_id      = (known after apply)
    }

  # module.data_landing_zone["01"].module.legacy_database["legacy-sql"].module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0] will be created
  + resource "azurerm_virtual_machine_extension" "azure_monitor" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "AMAWindows"
      + publisher                   = "Microsoft.Azure.Monitor"
      + tags                        = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
      + type                        = "AzureMonitorWindowsAgent"
      + type_handler_version        = "1.9"
      + virtual_machine_id          = (known after apply)
    }

  # module.data_landing_zone["01"].module.legacy_database["legacy-sql"].module.vm-bootstrap[0].azurerm_virtual_machine_extension.endpoint_protection[0] will be created
  + resource "azurerm_virtual_machine_extension" "endpoint_protection" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "AntiMalwareEndpointProtection"
      + publisher                   = "Microsoft.Azure.Security"
      + settings                    = <<-EOT
            {
                  "AntimalwareEnabled": "true",
                  "RealtimeProtectionEnabled": "true",
                  "ScheduledScanSettings": {"day":"7","isEnabled":"true","scanType":"Quick","time":"120"}
                }
        EOT
      + tags                        = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
      + type                        = "IaaSAntimalware"
      + type_handler_version        = "1.6"
      + virtual_machine_id          = (known after apply)
    }

  # module.data_landing_zone["01"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["01"].module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0] will be created
  + resource "azurerm_windows_virtual_machine_scale_set" "windows_scale_set" {
      + admin_password                                    = (sensitive value)
      + admin_username                                    = "VMAdmin"
      + computer_name_prefix                              = "shir001"
      + do_not_run_extensions_on_overprovisioned_machines = false
      + enable_automatic_updates                          = true
      + extension_operations_enabled                      = true
      + extensions_time_budget                            = "PT1H30M"
      + id                                                = (known after apply)
      + instances                                         = 1
      + location                                          = "uksouth"
      + max_bid_price                                     = -1
      + name                                              = "ingest01-shir001-vmss-sbox"
      + overprovision                                     = true
      + platform_fault_domain_count                       = (known after apply)
      + priority                                          = "Regular"
      + provision_vm_agent                                = true
      + resource_group_name                               = "ingest01-main-sbox"
      + single_placement_group                            = true
      + sku                                               = "Standard_D4ds_v5"
      + tags                                              = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
      + unique_id                                         = (known after apply)
      + upgrade_mode                                      = "Automatic"
      + zone_balance                                      = false
      + zones                                             = [
          + "1",
        ]

      + automatic_instance_repair (known after apply)

      + extension (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_interface {
          + enable_accelerated_networking = false
          + enable_ip_forwarding          = false
          + name                          = "ingest01-shir001-nic"
          + primary                       = true

          + ip_configuration {
              + load_balancer_backend_address_pool_ids = (known after apply)
              + load_balancer_inbound_nat_rules_ids    = (known after apply)
              + name                                   = "ingest01-shir001-ipconfig"
              + primary                                = true
              + subnet_id                              = (known after apply)
              + version                                = "IPv4"
            }
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + storage_account_type      = "StandardSSD_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2022-datacenter-azure-edition"
          + version   = "latest"
        }

      + spot_restore (known after apply)

      + termination_notification (known after apply)
    }

  # module.data_landing_zone["01"].module.shir001.module.shir_vmss.random_string.password will be created
  + resource "random_string" "password" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

Plan: 295 to add, 5 to change, 7 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.data_landing_zone["00"].module.storage["curated"].time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2023-11-15T15:38:04Z"
      - rotation_rfc3339 = "2024-11-09T15:38:04Z" -> null
        # (9 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.storage["external"].time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2023-11-15T15:38:04Z"
      - rotation_rfc3339 = "2024-11-09T15:38:04Z" -> null
        # (9 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.storage["raw"].time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2023-11-15T15:38:04Z"
      - rotation_rfc3339 = "2024-11-09T15:38:04Z" -> null
        # (9 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.storage["workspace"].time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2023-11-15T15:38:04Z"
      - rotation_rfc3339 = "2024-11-09T15:38:04Z" -> null
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":53,"Program":"tfcmt","SHA1":"","Target":"sbox_landing - TerraformPlanApply","Vars":{}} -->